import React from "react";
import styled from "styled-components";

const AboutScreen = () => {
	return (
		<Container>
			<Title>הסיפור שלנו</Title>
			<BigText>נעים להכיר, אנחנו עמותה חברתית כלכלית שבאה להציע שינוי בעולם הקמעונות בישראל.</BigText>
			<Text>
				בים הקמעונות יש הרבה דגים. ובשנים הראשונות של מדינת ישראל, הופיעו דגים קטנים רבים ששחו בזרם הכלכלי חברתי
				וניסו לטפח את עסקיהם ולהעניק שירות אישי ושכונתי למרחב בו השתקעו וחיו. אך בחלוף הזמן, החלו מספר דגים
				קטנים לאכול זה את זה ומהר מהר השתנו מי הים הקמעונאי ואותם דגים גדולים ואדירים החלו מאיימים יותר ויותר על
				הדגים הקטנים ולוקחים בעלות ונוכחות על המרחב הימי. התחושה השתררה בים שאין מנוס מהמצב חסר האיזון הזה ורבים
				מהדגים הקטנים חשו תפוסה ותחושה שימיהם ספורים וקצובים עד שיבואו הדגים הגדולים ויאכלו גם אותם. אבל אז קרה
				דבר קסם בים, משהו שלא ציפו לו והפתיע את כל יושבי הים הגדולים והקטנים כאחד! נוצרה תנועה שקטה אך עוצמתית
				של הדגים הקטנים שהחלו מתקבצים יחד ונעים מנקודה לנקודה תוך שחיה משותפת בצורה המחקה דג גדול ואדיר מימדים,
				אשר הפחיד וניטרל את כל אותם דגים גדולים ומאיימים והחזיר לדגים הקטנים את כוח ההרתעה שלהם בים והשיב להם את
				חיוניותם ועוצמתם לנוע במרחבי הים הקמעונאי כגוף גדול , יצירתי וחכם על פני אלו שביקשו לנטרל ולאכול אותו.
			</Text>
			<BigText>הסיפור הזה הוא הסיפור שלנו!</BigText>
			<Text>
				צמחנו מעולם הקמעונאות, כבעלי מרכולים ועסקים קטנים ממש כמוכם, חווינו אתגרים עם כניסתם של שחקנים גדולים
				ורבי השפעה לשוק הריכוזי ביותר בישראל בשנים האחרונות, עברנו התמודדויות לא פשוטות בניסיון להישאר רלוונטיים
				גם בעידן החדש והטכנולוגי שתופס תאוצה לאחרונה, ומעל הכל, הרגשנו שלא גודל העסק הוא שקובע אלא גודל הלב,
				הנחישות לא רק לשרוד את היום , אלא גם להתעלות ולהצליח בעסקים מעוצמת הביחד שלנו, שותפות הגורל לאותם מצוקות
				וצרכים וגם להפוך את הלימון שלנו ללימונדה, לראות איך אנו יכולים להתאגד ובעזרת משרדי הממשלה ועמותת פורום
				מזון ומכולת, אנו יכולים יחדיו ליצור פתרונות כלכלים וחברתיים למצוקות שבמחוזותינו מחד ומאידך, תמיד להיות
				בצד שנותן ומעניק חסות ושומר על אלו הקטנים מאיתנו, משפחות רווחה ואנשים נזקקים וחלשים שאנו מכירים מהשטח
				ומהשכונות בהן אנו פועלים ובכך יכולים תמיד להיות בצד המטיב והמסייע בחברה בישראל. בצד שהופך את המידות שלנו
				, למידות טובות של נתינה מן המעט שיש ושל עזרה הדדית. כך יצרנו את עמותת פורום מזון ומכולת שנוצרה מתוך צורך
				לחשוב מחוץ לקופסה אל מול פני המציאות שכולנו חווים ושורדים, זאת בכדי למצוא אלטרנטיבות לשינוי שעובר על
				כולנו ולייצר פתרון שהוא גם כלכלי וגם חברתי לרווחת כלל העסקים הקטנים והמכולות בישראל וגם לרווחת אוכלוסיות
				השוליים שאנו יכולים להרתם יחדיו לטובתם ובכך להיות גוף חברתי כלכלי חזק, יצירתי ועוצמתי בישראל גם בעידן
				החדש והטכנולוגי הבא עלינו לטובה.
			</Text>
			<BigText>מה הרעיון שלנו</BigText>
			<Text>
				עמותת פורום מזון ומכולת בתמיכת משרד הכלכלה והתמ"ת מציעה תוכנית פעולה מקיפה המאגדת את כלל המכולות והעסקים
				הקטנים בישראל, מעניקה לה יתרון יחסי מעוצמת הביחד דרך שירותי מחסן לוגיסטי, מחירים אטרקטיבים, הנגשה של
				אפליקציית משלוחים לפי אזורים ועזרה במרכזי הדרכה ובהכשרות לטובת המעבר לעידן החדש והטכנולוגי, ועוד במטרה
				להשתוות ל"דגים הגדולים" סביבנו מבחינת שירות, טכנולוגיה, מחירים, שיווק ופרסום ולתת תחרות בריאה ושוות
				אמצעים שרק תסייע ותוזיל בכך את סל הקניות בישראל לרווחת כלל תושביה. וגם תאפשר לנו להגדיל מעשה מכוח
				אחדותנו ולהפוך את ההכרות שלנו האישית והשכונתית עם משפחות הרווחה והמצוקה בקרבנו ולהעניק להם ביטחון תזונתי
				משמעותי דרך פתרונות קהילתיים כגון תלושי מזון, סל מוצרים מוזל, הטבות ותרומות שיוכלו בכך לחזק את השכבה
				החלשה ביותר במדינת ישראל ולהפוך אותנו לגדולים, במידות טובות ובעסקים טובים לתפארת מדינת ישראל.
			</Text>
			<BigText>רגע, איך אפשר לעשות את כל השינוי הזה?</BigText>
			<Text>פשוט זה לא אבל, גם לא כל כך מסובך…נסביר את השינוי בשלושה צעדים:</Text>
            
		</Container>
	);
};

const Container = styled.div`
	 {
        display: flex;
        flex-direction: column;
        direction: rtl;
		background-color: #fafafa;
		z-index: 1;
		display: flex;
		justify-content: center;
		align-items: center;
		height: 100vh;
		position: fixed;
		top: 0;
		bottom: 0;
		right: 0;
		left: 0;
	}
`;

const Title = styled.div`
	 {
		font-size: 3rem;
		font-weight: bold;
		box-shadow: 0px 0px 3px black;
	}
`;

const BigText = styled.div`
	 {
		font-size: 2rem;
		color: navy;
		box-shadow: 0px 0px 1px black;
	}
`;

const Text = styled.div`
	 {
		font-size: 1rem;
	}
`;

export default AboutScreen;
